![imagen](./img/hr.png)

In [ ]:
# https://www.sqltutorial.org/
# Ejemply pymsql + aws + pandas
import pymysql
import pandas as pd
ENDPOINT="hrdb.cn2cwau8envf.eu-north-1.rds.amazonaws.com"
PORT=3306
USER="admin"
REGION="eu-north-1b"
DBNAME="hrdb"
conn =  pymysql.connect(host=ENDPOINT, user=USER, passwd="BootcampDSPT24$", port=PORT)
# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = conn.cursor()

In [ ]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [ ]:
# Determinar que schema (colección de tablas) queremos usar
crsr.execute("USE HHRR_Jony;")

Cuenta el número de personas con distinto first_name por departamento

Cuenta el número de personas con igual first_name por departamento

Selecciona la personas con salario entre 5.000 y 15.000 y con número de teléfono nulo

Usa CASE-WHEN-THEN-END para crear la columna "ANTES_96" que sea "SÍ" para contratados antes del año 1996 y "NO" para contratados desde el año 1996 en adelante.

Usa CASE-WHEN-THEN-ELSE-END para repetir el ejercicio anterior pero con ELSE para los contratados desd el año 1996 en adelante

Cuenta el número de employees por cada manager (incluyendo el nombre en texto del manager, no solo el código ID) de mayor número de employees a menor

Selecciona la persona con menor salario cuyo manager es Neena
1. Busca el employee_id de Neena
2. Calcula el salario mínimo de aquellos que tienen el manager_id de Neena usando WHERE y el número de employee_id de Neena obtenido en la query anterior

Selecciona la persona con menor salario cuyo manager es Neena
1. Copia la query 2 del ejercicio anterior y sustituye el employee_id de Neena en la clausula where por la query que hiciste en el punto 1 del ejercicio anterior.

Cálcula los costes de salario por cada departamento con su nombre de departamento para aquellos departamentos que tengan unos costes de salario superiores a 10.000. Resuelvelo con HAVING y subqueries

Cuenta el número de employees por cada departamento y puesto de trabajo (incluyendo el nombre en texto del departamento y puesto, no solo el código) para departamentos/empleos con más de 3 empleados. Resuelvelo con subqueries y HAVING

Calcula el número de employees para los departamentos que empiezan por la letra A. 
Resuelvelo con JOIN y con SUBQUERIES

Calcula el salario máximo, mínimo y medio por cada departamento

In [ ]:
query = ''' 
SELECT department_name, MIN(salary) AS salario_min, MAX(salary) AS salario_max, AVG(salary) as salario_avg
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id  
GROUP BY e.department_id 
'''
sql_query(query)

Calcula la persona con salario mínimo por departamento
Debes mostrar el nombre y apellido de la persona, el nombre del departamento y su salario

Cuenta el número de employees por cada departamento (incluyendo el nombre en texto del departamento, no solo el código) con 2, 4 0 6 empleoyeess (probar WHERE y HAVING)

Muestra el nombre y apellido de las personas que son el único empleado para ese departamento y tipo de trabajo

Actualiza el apellido de employee_id 190 a "López"

In [ ]:
#No olvides el commit al final!
#crsr.execute("COMMIT;")

Incrementa el salario en un 2% de todos los empleados cuyo manager es Neena

In [ ]:
#No olvides el commit al final!
#crsr.execute("COMMIT;")

Crea la tabla 

CREATE TABLE courses_XX (
    course_id INT AUTO_INCREMENT PRIMARY KEY,
    course_name VARCHAR(256) NOT NULL
);
EN XX pon tu nombre

In [ ]:
#No olvides el commit al final!
#crsr.execute("COMMIT;")

Añade a la tabla courses:

INSERT INTO courses(course_name) VALUES ('Python');

INSERT INTO courses(course_name) VALUES ('SQL');

INSERT INTO courses(course_name) VALUES ('Introducción a la Fenomenología del Espíritu de Hegel para no hegelianos');

Selecciona la tabla courses tras los INSERT

In [ ]:
#No olvides el commit al final!
#crsr.execute("COMMIT;")

Prueba: INSERT INTO courses(course_id, course_name) VALUES (3, 'Hegel');

Pide al usuario que introduzca un nombre de empleado con input y muestra su Nombre, apellido, nombre de departamento, job title y salario